import React from "react";
import AppLogo from "./../resource/img/logor.jpg";
import { NavLink } from "react-bootstrap";
import PrivacyModal from "./Modal";

function Footer(props) {
  const [modalShow, setModalShow] = React.useState(false);
  const [msg, setMsg] = React.useState("");
  const [title, setTitle] = React.useState("");

  return (
    <footer className="img-text-footer" style={{ borderTop: "ridge" }}>
      <div className="imageDiv">
        <NavLink className=" mb-auto d-none d-lg-block" to="/">
          <img src={AppLogo} className="" alt="" width="90" />
        </NavLink>
      </div>
      <p className="mt-3">
        <span
          style={{ cursor: "pointer" }}
          onClick={() => {
            setModalShow(true);
            setMsg(
              "نقوم بحماية معلوماتك الشخصية بواسطة أجهزة أمنية. كما نقوم باستخدام طرف ثالث للتحقق والمصادقة على مباديء الخصوصية لموقعنا الإلكتروني شاملاً الخدمات. في حال اعتراضك على نظام معالجتنا لمعلوماتك الشخصية عن طريق النقل أو الاستخدام بأي وسيلة ، الرجاء ارسال طلبك بواسطة إحدى وسائل التواصل في (اتصل بنا) أو بإمكانك تجنب استخدام خدمات الموقع الإلكترونينحن لانقوم بالمتاجرة بمعلوماتك الشخصية بأي وسيلة كانت من بيع أو تأجير لأي طرف ثالث بدون الحصول على موافقتك الصريحة في المقام الأول"
            );
            setTitle("سياسة الخصوصية");
          }}
        >
          سياسة الخصوصية{" "}
        </span>
        |{" "}
        <span
          style={{ cursor: "pointer" }}
          onClick={() => {
            setModalShow(true);
            setMsg(
              "نرحب بكم في موقع و تطبيق safahatjo safahatjo.com (يشار إليها بالموقع الإلكتروني/ خدمات الأونلاين). يتم تشغيل الموقع من قبل safahatjo (يشار إليه بنحن/ لنا/ أو بصيغة الجمع)." +
                "" +
                'كمستخدم للموقع الإلكتروني يجب عليك قراءة وفهم الشروط والقوانين التالية ( قائمة "الشروط والأحكام").' +
                "" +
                "بمجرد استخدامك للموقع الإلكتروني بغرض الشراء ستكون ملزماً باتباع كافة الشروط والأحكام. يجب عليك مراجعة قائمة الشروط والأحكام بدقة قبل البدء باستخدام الخدمات الإلكترونية. في حال عدم الموافقة (أو لاتستطيع الإلتزام) بأي قانون أو شرط من القائمة ننصحك بعدم استخدام الخدمات الإلكترونية المقدمة من safahatjo." +
                "" +
                "safahatjo لها مطلق الحق بأي وقت بتعديل الاحكام والشروط في الموقع الإلكتروني بدون إشعار أو تنبيه مسبق. يمكنك الدخول إلى أحدث نسخة من الأحكام والشروط في أي وقت. في حالة عدم قبولك للتعديلات على للشروط و الأحكام فيجب عليك التوقف عن استخدام هذه الخدمة. في حال استمرارك باستخدام هذه الخدمة فإنك توافق على الالتزام بالبنود المعدلة على الشروط والاحكام في استخدام هذا الموقع." +
                "" +
                "" +
                "" +
                "شروط الاستخدام" +
                "" +
                "إن استخدام خدمات الموقع الإلكتروني متاحة فقط للأشخاص القادرين على تمثيل أنفسهم قانونياً. لايمكن للأشخاص غير القادرين على تمثيل أنفسهم قانونيا وفق نظام العقود المحلي استخدام خدمات الموقع الإلكتروني." +
                "" +
                "" +
                "هذه الشروط والأحكام تعتبر سارية المفعول ولاغية لما قبلها من أشكال التمثيل التجاري أو الاتفاقيات الشفهية أو غيرها من المفاهمات مالم يخصص بهذا الشأن شروط اضافية خاصة بمنتج معين أو خدمة محددة." +
                "" +
                "باستخدامك لخدمات الموقع الإلكتروني ستكون ملزماً باتباع بنود الشروط والأحكام." +
                "" +
                "" +
                "" +
                "الحماية الأمنية للموقع الإلكتروني" +
                "" +
                "لايجوز لك بتاتاً أن تنتهك أو تحاول انتهاك الحماية الأمنية للموقع الإلكتروني وذلك يتضمن الآتي:" +
                "" +
                "الولوج إلى معلومات غير مخصصة لك أو الدخول إلى خادم الانترنت أو حسابٍ لست مخولاً باستخدامه بشكل رسمي." +
                "محاولة استكشاف أو فحص أو اختبار مدى قدرة النظام أو الشبكة أو محاولة اختراق النظام الأمني أو مستويات الحماية دون أن تكون مخولاً بذلك." +
                "محاولة التشويش أو التداخل على الخدمة المقدمة لأي مستخدم آخر أو مضيف أو شبكة أو مضيف وذلك يتضمن دون حصر نشر و إرسال الفيروسات الى الموقع الإلكتروني ، أو إثقال الموقع أو إرسال الرسائل المتسلسلة أو البريد الإلكتروني غير المرغوب فيه أو أي وسيلة أخرى قد تضر بسلامة الشبكة." +
                "إرسال الرسائل غير المرغوب فيها وذلك يتضمن العروض التجارية و/ أو الإعلانات للمنتجات أو الخدمات." +
                "المحاكاة بغرض التزويرلعنوان بروتوكول الانترنت أو عنوان البريد الإلكتروني أو أي جزء من عنوان الموقع الإلكتروني وإستخدامها في أي بريد الكتروني أو مجموعة بريدية. إن الانتهاكات المضرة بالنظام أو أمن الشبكة سينتج عنها جزاءات مدنية وجنائية في أغلب الحالات." +
                "إنك بهذا توافق على عدم استخدام موارد النظام من أجهزة أو برامج أو أي طريقة للتشويش أو التداخل أو محأولة التداخل مع سير عمل الموقع الإلكتروني أو أي نشاط أوخدمة يقدمها الموقع. سيقوم الموقع الإلكتروني بالتقصي عن النشاطات التي قد تنطوي على هذه الانتهاكات وسيقوم بالتعأون مع الجهات القضائية المختصة لمقاضاة و تطبيق العقوبة اللازمة على الأشخاص الضالعين في مثل هذه الانتهاكات." +
                "" +
                "" +
                "" +
                "التسجيل - حسابي الشخصي" +
                "" +
                "تتضمن عملية التسجيل المعلومات (معلوماتك الشخصية) التي تزودنا بها لإتمام معاملاتك و أيضاً للإتصال بك. يجب عليك القبول بمبدأ استخدامنا لمعلوماتك الشخصية وتحديثها وذلك للتعامل مع عملية التسجيل وللتحكم بسرية هويتك خلال عملية المتابعة لتسليم طلب الشراء والدفع الكترونياً." +
                "" +
                "إن المعلومات الي تقدمها خلال عملية التسجيل هي بيانات محمية وفقاً لبنود حماية الخصوصية الموضحة سابقاً. تشكل معلوماتك الشخصية جزءا من سجلك الخاص لتعاملاتك مع خدماتنا. في حالة استخدامك لموقعنا الإلكتروني ستكون مسؤولاً عن المحافظة على سرية حسابك الشخصي و كلمة المرور بالإضافة إلى منع الوصول الى جهازك الشخصي/ جهاز الكمبيوتر وأنت بذلك تتحمل المسؤولية عن جميع العمليات التي يتم تنفيذها من خلال حسابك الشخصي باستخدام كلمة المرور." +
                "" +
                "لايتحمل الموقع الإلكتروني أي مسؤولية تجاه أي شخص عن أي خسارة أو أضرار قد تنشأ بسبب فشلك في حماية كلمة المرور الخاصة بك أو أي معلومات أخرى متعلقة بحسابك الشخصي. في حال الشك بوجود عمليات مشبوهة في حسابك الشخصي يرجى إخطارنا بالاتصال بنا فورا من خلال أي وسيلة (اتصل بنا)" +
                "" +
                "" +
                "" +
                "التواصل الإلكتروني" +
                "" +
                "بموافقتك استخدام موقعنا الإلكتروني فإنك بذلك توافق على استقبال رسائلنا الإلكترونية بجميع أشكالها من خلال البريد الإلكتروني أو النشرات الدورية أو الإشعارات و التنبيهات المعلن عنها في الموقع الإلكتروني. و بناءاً عليه فإنك توافق ضمنياً على أن جميع المعاملات الإلكترونية المرسلة لك من قبلنا هي ملزمة قانونيا وتعامل معاملة المعاملات الخطية." +
                "" +
                "يحق لنا مراقبة وتسجيل وحفظ أي مكالمة هاتفية أو بريد الكتروني أو أي شكل آخر من اشكال التواصل الإلكتروني معك وذلك لأغراض تدريبية بهدف التحقق من النصائح والملاحظات الموجهة إلينا ولتحسين وتطوير نوعية الخدمة المقدمة لعملائنا." +
                "" +
                "" +
                "" +
                "تفاصيل المنتجات، المخزون والأسعار" +
                "" +
                "في سعينا الدائم والحثيث لتقديم معلومات دقيقة وشاملة عن منتجاتنا ( مثل توفر المنتج و الأسعار و مواصفات المنتجات و الصور التوضيحية والخصائص الفنية) و تقديم معلومات شاملة عن الخدمات، قد تصادفنا بعض الأخطاء المطبعية." +
                "" +
                "يتم مراعاة أقصى حدود الدقة في عرض ألوان المنتجات في الموقع الإلكتروني ، ولكن ما تراه من ألوان ظاهرة في الموقع يعتمد بشكل أساسي على إعدادات شاشتك وهذا يقع خارج نطاق صلاحيتنا حيث لا يمكننا التاكد بشكل جازم من إعدادات الألوان المعتمدة في شاشتك." +
                "" +
                "إن نشرالتفاصيل المتعلقة بالمنتجات أو الخدمات ( يتضمن ولكن لا يقتصر على: نشرات التسويق و الإعلانات والعروض التجارية وعروض المجلات والمنشورات الصغيرة) على الموقع الإلكتروني لا يعتبر ضماناً على توفر المنتجات أو العروض أو الأسعار سواء من خلال التسوق الإلكتروني أو في المعرض بطريق مباشر." +
                "" +
                "قد تحدث بعض الأخطاء خلال عملية توفير المنتج أو الخدمة وتوفير المعلومات التفصيلية عن الأسعار على الموقع الإلكتروني. لايمكن للموقع الإلكتروني تزويدك بأسعار المنتجات بشكل منفرد أو معرفة التكلفة الإجمالية للمنتج أو الخدمة حتى تقوم بتسليم طلبك الإلكتروني كاملاً. في حال تم طلب وإصدار الفاتورة لمنتج أو خدمة و كان السعر غير صحيح أو كانت المعلومات غير صحيحة لورود خطأ في تسجيل السعر الصحيح أو معلومات المنتجات أو الخدمات فيحق للموقع الإلكتروني في هذه الحالة إما أن يتواصل معك لتوضيح هذا الخطأ وكيفية التعامل معه أو إلغاء طلبك و إشعارك بهذا الإلغاء. في حال تم قبول طلبك وتمت متابعته الكترونياً ، سيتم احتساب التكلفة الإجمالية وخصمها من حساب بطاقتك الإئتمانية و سنقوم بإبلاغك عن طريق البريد الإلكتروني بأن عملية الدفع تجري بالشكل الصحيح." +
                "" +
                "إن توفر المنتجات وكذلك الأسعار هي عرضة للتغيير بدون إنذار مسبق." +
                "" +
                "معلومات المخزون والأسعار تخص الموقع الإلكتروني فقط" +
                "" +
                "" +
                "" +
                'إن خدمة "التوصيل المنزلي بواسطة شركات الشحن" هي خدمة "من الباب إلى الباب" في معظم الأحوال، ولكن نعتذر عن عدم تطبيق هذه الخدمة في بعض من الحالات وذلك بسبب محدودية شركة التوصيل أو بسبب بعض القوانين المحلية. إننا بالاتفاق مع فيديكس - شركائنا في التوصيل- نحتفظ بالحق التام بعدم تسليم الطلب لشخص يقل عن 18 عاماً حال توصيل المنتج .عند تسليم طلب التوصيل الكترونياً وكان الطلب يتضمن عدة منتجات من المنتجات الثقيلة والخفيفة الوزن فسيتم توصيلها إلى العنوان المحدد تحت شحنات وأوقات مختلفة.' +
                "" +
                "" +
                "" +
                "إن خدمة التوصيل المنزلي من safahatjo تتيح لك خدمة التركيب الأساسي للمنتجات التي تم توصيلها. إن خدمة التوصيل المنزلي من بواسطة شركات الشحن غير مسؤولة عن أي أعمال تركيب قد يتطلبها المنتج الذي تم إيصاله." +
                "" +
                "يتم حساب رسوم الشحن لخدمة التوصيل المنزلي وفقاً لخطة الشحن المختارة بالإضافة إلى وزن و/أو حجم وأبعاد المنتج المطلوب توصيله. في حالة الفشل في توصيل الطلب وكان ذلك ناتجا عن خطأ من قبلك (وذلك يتضمن وليس حصرا على- كتابة عنوان خاطيء، كتابة اسم غير صحيح) ففي هذه الحالة يتم تطبيق رسوم إضافية عليك لإعادة إرسال الطلب." +
                "" +
                "يمكنك أيضاً استلام منتجاتك من المعرض، إن الخدمة متاحة في جميع معارض safahatjo للمنتجات الصغيرة فقط. خلال عملية طلب منتجاتك، تحقق من صفحة الخاصة بكل منتج على حدة، قد يتم تطبيق بعض الاستثناءات." +
                "" +
                "" +
                "يجب عليك أن تتأكد من المعلومات المتعلقة ببطاقتك الإئتمانية التي تستخدمها في الدفع للخدمات الإلكترونية بأن تكون صحيحة و سارية المفعول، ويجب عليك استخدام البطاقة الإئتمانية التابعة قانونيا لك. لن يتم استخدام أو مشاركة معلوماتك الشخصية من قبل الخدمات الإلكترونية مع أي طرف ثالث ويستثنى من ذلك التحقق من شرعية المعلومات وعدم تزويرها أو عند طلبها من القانون أو الأنظمة الشرعية أو بطلب من المحكمة. لن تكون خدمة الموقع الإلكتروني (أونلاين) مسؤولة بأي شكل من الأشكال عن تزوير البطاقات الإئتمانية. سيتم تحميلك كافة المسؤوليات عن استخدام البطاقات الإئتمانية المزورة وستكون مسؤولا بشكل كامل عن اثبات خلاف ذلك." +
                "" +
                "في حال عدم تمكننا من توفير الطلب أو جزء منه فسنبلغك مباشرة بهذا الخصوص . سيتم إرجاع كامل أو جزء من المبلغ المدفوع بواسطة البطاقة الإئتمانية التي استخدمتها لدفع مبلغ الطلب." +
                "" +
                "إن استخدامك لخدمة الدفع الإلكتروني (أونلاين) لموقعنا الإلكتروني هو بمثابة موافقة ضمنية لالتزامك بهذه الشروط .في حال عدم موافقتك لأي بند من بنود هذه الشروط فنرجوا منك عدم استخدام هذه الخدمة." +
                "" +
                "" +
                "" +
                "إلغاء الطلب" +
                "" +
                "تحتفظ safahatjo بحق إلغاء الطلب لأي سبب من الأسباب التالية:" +
                "" +
                "رفض/ عدم قبول عملية الدفع" +
                "تأخر العميل لاكثر من (1) ساعة واحدة عن الدفع من خلال نظام سداد للمدفوعات." +
                "شراء العميل أكثر من 2 قطعة من نفس المنتج." +
                "إذا كان عنوان التوصيل المعطى من قبل الزبون خاطئاً أو كانت معلومات الاتصال خاطئة أو لعدم القدرة على الوصول إلى الزبون." +
                'عدم حضور الزبون/العميل أو تأخره عن استلام الطلب لأكثر من 7 أيام لاستلام طلبه المدفوع بواسطة الانترنت( أونلاين) لخدمة "الاستلام من المعرض".' +
                'عدم حضور الزبون/العميل أو تأخره لمدة تزيد عن 48 ساعة لاستلام طلبه عند اختياره الدفع في المعرض لخدمة "الاستلام من المعرض".' +
                "و لذلك اي مبيعات جمله زياده عن قطعتين من نفس الصنف للعميل الواحد سوف يتم الغاء الطلب حسب توجيهات الادارة." +
                "للعميل الحق في حجز الصنف الذي تم شرائه لمدة 15 يوم فقط، وسيتم فك الحجز في اليوم ال16 مع حفظ حق العميل باسترجاع كامل قيمة المنتج." +
                "إلغاء الطلب من طرف العميل: للمتابعة في عملية إلغاء الطلب ، يجب عليك الإتصال بنا أولا. باستطاعتك إلغاء طلبك لأي سبب من الأسباب التالية:" +
                "" +
                "إذا لم يتم توصيل أو شحن الطلب إليك. في حال تم الإلغاء بعد شحن أو إرسال الطلب سيتم فرض رسوم إلغاء عليك. نحتفظ بالحق التام لمطابقة الوقت الذي تم فيه شحن طلبك مع الوقت الذي ارسلت فيه طلب الإلغاء." +
                "لايمكننا توفير أو توصيل المنتج في غضون مدة زمنية معقولة وهي عشرة أيام عمل من يوم تأكيد الطلب." +
                "" +
                "" +
                "" +
                "إن جميع المنتجات المباعة في معارضنا قد اجتازت فحوصات الجودة و تعتبر جاهزة للاستخدام عند شحنها. إذا كانت هناك أي مشكلة مع المنتج بعد (7) أيام من استلامك المنتج ، ننصحك بالاتصال مباشرة بإحدى وسائل التواصل (اتصل بنا)." +
                ""
            );
            setTitle("الشروط الأحكام");
          }}
        >
          الشروط الأحكام
        </span>
      </p>

      <PrivacyModal
        show={modalShow}
        onHide={() => {
          setModalShow(false);
          setMsg("");
          setTitle("");
        }}
        msg={msg}
        title={title}
      />
    </footer>
  );
}

export default Footer;
